# Calculates how much each person should pay based on inputs of total bill, tip percentage, and number of people
# (Кафе/рестораналда кьезе ккараб гlарац киназдаго гьоркьоб бикьизе кумек гьабиялъе гlуцlцlараб программа)

print("\nРорчlами гlарац бикьизе кумек гьабулеб программаялде!")

while True:
    # Bill
    try:
        bill = int(input("Кинаниги кидагlанасеб гъурущ кьезе кколеб нужеца?\n--->> "))
    except ValueError:
        print("Йа гьудул, дуда гlарцул цехолеб мехалъ, хlарпал хъваге хале! Цlидасан биччай гьанже.")
        break

    # Tip
    print("Нужее квен кьолев вукlарав чияса жиндир хlалтlи лъикl гьабурищ? Жиндие чаялъе гlарац кьезе гьев мустахlикъав вугищ?")
    is_tip = input('Ватани "+" хъвай, ватичlони "-" хъвай\n--->> ')
    if is_tip == "+":
        tip = int(input("Кинаниги ккараб гlарацадаса чан процент квен кьолев чиясе чаялъе кьезе бакьине нужее?\n--->> "))
    elif is_tip == "-":
        tip = 0
    else:
        print("Йа гьудул, мун школалдегойищ хьвадичlев? Яги дуда гьениб жубай-багъигойищ малъичlеб?"
              "\nТlокlаб щибго жо хъвачlего, цохlо + яги - хъвай гьадуб сагlаталъа. Байбихье гьанже цlидасан.")
        break

    # Is reach person?
    print("Гьа! Вугищ нужеда гьоркьоб рес бугев бихьинчи, Аллагьасе гlоло 'ма!'-янги абун киназухъго гlарац жиндир кесенисан биччан бажарулев?")
    is_reach_person = input('Ватани "+" хъвай, ватичlони "-" хъвай\n--->> ')
    if is_reach_person == "+" or is_reach_person == "-":
        if is_reach_person == "+":
            print(f"Лъугlанаха хабар. Гьеса кьезе ккола {round(bill * (1 + tip / 100), 2)} гъурущ. Аллагьас гьесул сайгъат къабул гьабеги!")
            break
    else:
        print("Йа гьудул, мун школалдегойищ хьвадичlев? Яги дуда гьениб жубай-багъигойищ малъичlеб?"
              "\nТlокlаб щибго жо хъвачlего, цохlо + яги - хъвай гьадуб сагlаталъа. Байбихье гьанже цlидасан.")
        break

    # Amount of people
    try:
        people = int(input("Чан чиясда гьоркьоб цинги бикьизе коллеб?\n"))
    except ValueError:
        print('Йа гьудул, дуда "чан"-ан цехолеб мехалъ, хlарпал хъваге хале! Цlидасан биччай гьанже.')
        break

    # Calculate
    total_bill = bill * (1 + tip / 100)
    print(f"Гьедин батани, жив живаса кьезе ккола: {round(total_bill / people, 2)} гъурущ.")
    break

print("\nЦlидасан биччазе бокьун бугони гlурччинаб кнопка мерхье.")
